print('Введите цвета: ')
a, b = input(), input()
if a != 'красный' and a != 'желтый' and a != 'синий':
    print("Ошибка цвета.")
elif b != 'красный' and b != 'желтый' and b != 'синий':
    print("Ошибка цвета.")
elif a == 'красный' and b == 'синий' or a == 'синий' and b == 'красный':
    print('Фиолетовый.')
elif a == 'красный' and b == 'желтый' or a == 'желтый' and b == 'красный':
    print('Оранжевый.')
elif a == 'желтый' and b == 'синий' or a == 'синий' and b == 'желтый':
    print('Зеленый.')
elif a == 'красный' and b == 'красный':
    print('Красный.')
elif a == 'синий' and b == 'синий':
    print('Синий.')
elif a == 'желтый' and b == 'желтый':
    print('Желтый.')